'''
海盗们举行金币分享仪式，一群海盗围绕船长逆时针坐成一个圈，最开始船长给每个海盗发【偶数枚】金币
当船长举旗时，所有的海盗将自己【手中一半】的金币分给他右手边的海盗。
此时，如果海盗手中的金币的数目为奇数，那么船长就立刻再给他一枚。

船长继续举旗，规则同上，循环。当所有海盗手中的金币数量相同时，游戏结束。
给定海盗人数和海盗初始金币数，试求船长举旗的次数和游戏结束时海盗手中金币的个数

输入输出：
输入的数据包含两行，第一行输入N代表海盗人数，第二行输入N个偶数，代表海盗的初始金币数

输出的数据共一行，包括两个数，第一个为船长举旗的次数，第二个为海盗最终分得的金币数

样例说明：
输入样例 1
6
36 2 2 2 2 2
输出样例 1
15 14

输入样例 2
11
22 20 18 16 14 12 10 8 6 4 2

'''
N=int(input())
initial=[int(x) for x in input().split()]
def same(li):
    if li==[li[0]]*len(li):
        return True
    return False
count=0
while not same(initial):
    new=[]
    for i in range(0,N):
        new.append(initial[i]//2)
        initial[i]=(initial[i]//2)
    for i in range(0,N):
        if i <=N-2:
            initial[i+1]+=new[i]
        else:
            initial[0]+=new[i]
    for i in range(0,N):
        if initial[i]%2!=0:
            initial[i]+=1
    count+=1
print(count,initial[0])

'''
[BUG]
1、每一轮的顺序非常重要。（即要精确的确定哪一个步骤是这句的开始，如把检查自己的牌是不是奇数 当做开始，循环次数就会有问题！！！）
    本游戏的顺序为：自己拿掉一半（自己减半）--给右边的人（右边的人加上左边的人的一半）--检查自己的牌（奇数就+1）
2、每一步头脑都应该非常清晰，不能只做了一半就进行下一步呢！
    如自己拿出来一半存在一个列表之中的同时，自己也要减半呀！！！
'''
