include<iostream>
using namespace std;
/*
按学号从小到大，输入n个学生的三门课成绩，n<100?。
输入说明：先输入n，再输入n个学生学号和三门课成绩，学生的学号为4位整数，各门课的成绩为整数。
输出说明：按学号从小到大，输出总分最高的学生学号，每个学号占一行。
Sample:
Input
10--一共10个学生
1001?? ?98 ?? ?94 ?? ?91－－学号+三门课的成绩?
1002?? ?68 ?? ?65 ?? ?61?
1003?? ?85 ?? ?75 ?? ?91?
1004?? ?73 ?? ?66 ?? ?62?
1005?? ?77 ?? ?79 ?? ?86?
1006?? ?93 ?? ?96 ?? ?93?
1007?? ?66 ?? ?84 ?? ?75?
1008?? ?76 ?? ?57 ?? ?74?
1009?? ?87 ?? ?78 ?? ?66?
1010?? ?99 ?? ?95 ?? ?89?
Output:
1001－－－1001和1010号学生的成绩总和是相同哒,小心他可能会有两个是相同大小的！
1010

题目思考：
本质上上面这些可以看成是一个二维数组的形式呢！n行4列的形式呢
操作1：输入－－两个循环就可以啦（列是恒定四个的）
操作2：加和－－后面三个每行都要相加**循环的时候内层循环初始值为1就可以①每行加和②每行每行之间分别比大小！！！
*/
int main()
{
	int n;
	cin >>n;//确定好了是n行4列
	int arr[n][4];
    for(int i=0;i<n;i++)
    {
    	for(int j=0;j<4;j++)
    	{
    		cin >> arr[i][j];
    	}
    }
    int sum[n];//用来把每行的加和都存起来
    for(int i=0;i<n;i++)//得从第二项开始加哦 
    	sum[i]=arr[i][1]+arr[i][2]+arr[i][3];
    int a=0;					//定义的a应该在for循环的外边啦！！！要多次利用这个a的哦 
    for(int i=0;i<n;i++)//比较sum[i]中哪个最大》》返回他的arr[i][0]
    {
    	if(sum[a]<=sum[i]) //最大的就是sum[a]啦
    		a=i;
	}
    for(int i=0;i<n;i++)
    {
    	if(sum[a]==sum[i])//==一定要小心！！！编译会让你通过的！！！ 
    		cout<<arr[i][0]<<endl;
	/*
	错误1：换行符的位置可以直接放在cout的后面，也可以放在arr的后面，要根据题目需求来的！
		   是先换行还是先输出1
	错误2：可能会有重复的。最后一个判断的时候因为i是从0循环到n-1的！
		   》》一定会跟其中的n重复一次的！！
		   》》方法一：在判断的时候&&a！=i，且在前面先输出一遍arr[a][0] 
		   	   方法二：直接不需要第一次的输出！（本质上先输出一次是因为题目没有考虑清楚，他会有相同大小 
				  		的情况就应该一块输出，而不是分着输出！） 
	*/		 
    }
    return 0;
}
