'''
定义两个形状为 2 * 3 * 2 的张量 a 和 b，其中的数据都初始化为 1 ~ 5之间的随机整数。
请进行以下操作：
（1）打印张量a和b
（2）分别使用numpy自带的操作符和三重for循环对于张量a和b进行逐元素加操作并输出结果
（3）将张量a, b分别在第0、1、2个坐标轴上进行拼接操作并观察结果。目标：熟悉numpy的随机初始化矩阵、逐元素运算、元素索引和张量拼接操作。

例子：
输入：

a =
[[[2 1]
  [3 2]
  [2 1]]

 [[3 2]
  [4 4]
  [3 3]]]

b =
[[[2 4]
  [4 2]
  [1 4]]

 [[2 3]
  [2 3]
  [2 2]]]

输出：

逐元素加法操作
[[[4 5]
  [7 4]
  [3 5]]

 [[5 5]
  [6 7]
  [5 5]]]

第0维拼接
[[[2 1]
  [3 2]
  [2 1]]

 [[3 2]
  [4 4]
  [3 3]]

 [[2 4]
  [4 2]
  [1 4]]

 [[2 3]
  [2 3]
  [2 2]]]

第1维拼接
[[[2 1]
  [3 2]
  [2 1]
  [2 4]
  [4 2]
  [1 4]]

 [[3 2]
  [4 4]
  [3 3]
  [2 3]
  [2 3]
  [2 2]]]

第2维拼接
[[[2 1 2 4]
  [3 2 4 2]
  [2 1 1 4]]

 [[3 2 2 3]
  [4 4 2 3]
  [3 3 2 2]]]
'''
import numpy as np
a=np.random.randint(1,5,size=(2,3,2))
b=np.random.randint(1,5,size=(2,3,2))
print(a)
print(b)
c=a+b
d=np.arange(12).reshape((2,3,2))#是整数！
#d=np.zeros((2,3,2))创建完了之后是float的浮点数！
for i in range(0,2):
    for j in range(0,3):
        for k in range(0,2):
            d[i][j][k]=a[i][j][k]+b[i][j][k]
print(c)
print(d)
print(np.append(a,b,axis=0))
print(np.append(a,b,axis=1))
print(np.append(a,b,axis=2))

#如果自己实现（不用append函数）可以先创建一个确定大小的矩阵，再去修改其中的数字就可以啦
